In [1]:
import configparser
config = configparser.ConfigParser()

In [2]:
from sqlalchemy import create_engine, text
import pandas as pd

In [3]:
!pwd

/c/Users/zahid/ironhackAbr23Class/repo_example_ml

In [4]:
config.read('config/config.cfg')

['config/config.cfg']

In [5]:
config.sections()

['RelationalDatasetRepository']

In [6]:
conf_default = config['DEFAULT']
conf_rel = config['RelationalDatasetRepository']

In [7]:
conf_default.get('ServerAliveInterval')

'45'

In [8]:
conf_default.getint('ServerAliveInterval')

45

In [9]:
conf_default.get('Verdadero')

'True'

In [10]:
conf_default.getboolean('Verdadero')

True

El url tiene que tener una forma de la siguiente

mysql+pymysql://<username>:<password>@<host>/<dbname>[?<options>]

<flavor>+<driver>://<username>:<password>@<host>/<dbname>[?<options>]

In [11]:
url = f'mysql+pymysql://{conf_rel.get("User")}:{conf_rel.get("Password")}@relational.fit.cvut.cz:3306'

In [12]:
engine = create_engine(url)

In [13]:
df_salaries = pd.read_sql_query('SELECT * FROM employee.salaries LIMIT 15', engine)

In [14]:
df_salaries.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

In [15]:
url = f'mysql+pymysql://{conf_rel.get("User")}:{conf_rel.get("Password")}@relational.fit.cvut.cz:3306/employee'
engine = create_engine(url)
df_salaries = pd.read_sql_query('SELECT * FROM salaries LIMIT 15', engine)
df_salaries.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

In [19]:
tables = ['salaries', 'titles', 'dept_emp', 'dept_manager', 'employees', 'departments']
dfs = []
failed_tables = []
error = []
for table in tables:
    print(table)
    try:
        dfs.append(pd.read_sql_query(f'SELECT * FROM {table}', engine))
    except Exeption as e:
        failed_tables.append(table)
        error.append(e)

salaries
titles
dept_emp
dept_manager
employees
departments

In [23]:
for df in dfs:
    print(df.shape)

(2844047, 4)
(443308, 4)
(331603, 4)
(24, 4)
(300024, 6)
(9, 2)